CoreTemplates/AMI/kOmegaSST/wall-functions/system/meshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}

#include "../Parameters/meshDict.cpp"

boundaryLayers
{
    patchBoundaryLayers
    {
        propeller
        {
            nLayers                 $nLayers;
            thicknessRatio          $thicknessRatio;
            allowDiscontinuity      $allowDiscontinuity;
            maxFirstLayerThickness  $maxFirstLayerThickness;
        }
    }

    optimiseLayer 1;

    optimisationParameters
    {
        nSmoothNormals      10;
        maxNumIterations    10;
        featureSizeFactor   0.2;
        recalculateNormals  1;
        relThicknessTol     0.15;
    }

    // The installed binary always performs layer untangling and does not
    // contain a runtime parser for the source-release key untangleLayers.
}
